---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarBarDiameter
source: html/3cb5994d-0d75-dd1a-7602-9be344366919.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarBarDiameter Property

"Bar Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarBarDiameter { get; }
```